'''
4 6
0 0 0 0 0 0
0 0 0 0 0 0
0 0 1 0 6 0
0 0 0 0 0 0
20
'''

'''
[풀이방법]
1. 0: 빈 칸, 6: 벽, 1: 한방향, 2: 서로반대방향, 3: 직각방향, 4: 세방향, 5: 4방향
2. cctv위치를 찾는다.
   2-1. zone = N * M - (0아닌곳) -> 
   2-2. 1~5 가능한 cctv방향 지정해놓고 돌리기!(dictionary로)
3. 뻗어나가다가 6있으면 stop -> cctv 감시되는곳 -1로 바꾸고, 0인곳 갯수세기 -> 최소인 값 갱신
   3-1. 이때 방향이 바뀔때마다 board 처음부터 시작해야함
'''

def look():
    pass



dis = {1: [[(-1, 0)], [(1, 0)], [(0, 1)], [(0, -1)]],
       2: [[(-1, 0), (1, 0)], [(0, 1), (0, -1)]],
       3: [[(-1, 0), (0, 1)], [(0, 1), (1, 0)], [(1, 0), (0, -1)], [(0, -1), (-1, 0)]],
       4: [[(-1, 0), (0, 1), (1, 0)], [(0, 1), (1, 0), (0, -1)], [(1, 0), (0, -1), (-1, 0)], [(0, -1), (-1, 0), (0, 1)]],
       5: [[(-1, 0), (1, 0), (0, 1), (0, -1)]]
       }


N, M = map(int, input().split())
board = [list(map(int, input().split())) for _ in range(N)]

cctv = []
zero = 0
for i in range(N):
    for j in range(M):
        if board[i][j] != 0 and board[i][j] != 6:
            cctv.append((i, j))
        elif board[i][j] == 0:
            zero += 1

for d in dis.keys():
    for c in cctv:
        if d == c:
            for a, b in 